Revit 2027 API
ElementIntersectsFilter Methods
The ElementIntersectsFilter type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCategorySupported |  Identifies if the input element is of a category supported by element intersection filters.
IsElementSupported |  Identifies if the input element is supported by element intersection filters.
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace